[
  {
    "title": "Sheikh Hasina: The pro-democracy icon who became an autocrat",
    "description": "Bangladesh's Prime Minister Sheikh Hasina Wazed has resigned and left the country after weeks of student-led protests spiralled into deadly, nationwide unrest. The 76-year-old fled in a helicopter on Monday to India, reports said, as thousands of protesters stormed her official residence in the capital Dhaka. This brings an unexpected end to the reign of Bangladesh's longest-serving PM, who has been in power since 2009 and ruled the country for more than 20 years in total.",
    "imageUri": "https://ichef.bbci.co.uk/news/1024/cpsprodpb/15b1/live/3cf627b0-52e8-11ef-bbe8-4939b38c4f8f.jpg.webp",
    "postUri": "https://www.bbc.com/news/articles/c1d77xe2p26o"
  },
  {
    "title": "Google's online search monopoly is illegal, US judge rules",
    "description": "A US judge has ruled Google acted illegally to crush its competition and maintain a monopoly on online search and related advertising. The landmark decision on Monday is a major blow to Alphabet, Google's parent company, and could reshape how technology giants do business. Google was sued by the US Department of Justice in 2020 over its control of about 90% of the online search market.",
    "imageUri": "https://ichef.bbci.co.uk/news/1024/cpsprodpb/62e8/live/650324e0-5362-11ef-a58d-65786c1faf90.jpg.webp",
    "postUri": "https://www.bbc.com/news/articles/c1d77xe2p26o"
  },
  {
    "title": "Harris set to name running mate as global turmoil rocks an already surreal campaign",
    "description": "The stunning transformation of the 2024 presidential race will reach new heights Tuesday when Vice President Kamala Harris unveils her running mate after a sequence of events that left Republican nominee Donald Trump flailing. Harris is due to join her vice presidential pick at a rally in Philadelphia that will kick off a joint sprint across an electoral map expanded by President Joe Biden’s shelving of his own reelection bid just over two weeks ago.",
    "imageUri": "https://media.cnn.com/api/v1/images/stellar/prod/2024-08-02t235544z-1633287621-rc2b79a76khq-rtrmadp-3-usa-election-harris-campaign.jpg?c=16x9&q=h_653,w_1160,c_fill/f_webp",
    "postUri": "https://edition.cnn.com/2024/08/06/politics/harris-running-mate-global-turmoil/index.html"
  },
  {
    "title": "The last time this wrestler competed at the Olympics, she did not concede a single point",
    "description": "She only recently turned 25, but Yui Susaki is already a reigning Olympic gold medalist and four-time world champion, and is widely touted as the best pound-for-pound freestyle wrestler in the world. Susaki – all 5 feet (1.52 meters) of her – has never lost an international bout at senior level, and another dominant performance at the Paris Games could propel her into the conversation over the greatest of all time. So how does she do it?",
    "imageUri": "https://media.cnn.com/api/v1/images/stellar/prod/02-wrestler-yui-susaki.jpg?c=16x9&q=h_653,w_1160,c_fill/f_webp",
    "postUri": "https://edition.cnn.com/2024/08/05/sport/japan-yui-susaki-wrestler-profile-olympics-spt-intl-hnk/index.html"
  },
  {
    "title": "Zoom launches AI-powered Docs feature to help workplace collaboration",
    "description": "Zoom has launched a new feature so users can now generate a document with AI and create shareable files based on their meetings, while also being able to use Generative AI to write and edit them. As a part of Zoom Docs, users can also prompt the AI Companion to organise meeting transcripts, create tables, make checklists, as well as track processes and tasks assigned in the meeting.",
    "imageUri": "https://th-i.thgim.com/public/incoming/7go2vw/article68491587.ece/alternates/LANDSCAPE_660/2024-05-20T201228Z_1052045239_RC2JU7AGRP0X_RTRMADP_3_ZOOM-VIDEO-COMMN-RESULTS.JPG",
    "postUri": "https://www.thehindu.com/sci-tech/technology/zoom-launches-ai-powered-docs-feature-to-help-workplace-collaboration/article68491596.ece"
  },
  {
    "title": "Iran’s promised retaliation could see regional proxies playing a greater role",
    "description": "As Iran threatens to respond to the suspected Israeli assassination of Hamas leader Ismail Haniyeh in Tehran, the regional militias that the Islamic Republic has armed for decades could play a role in any attack. Iran’s policy of arming militias took root in the aftermath of the 1979 Islamic Revolution. Before it, the U.S. provided major weapon systems including F-14 Tomcat fighter jets to the government of Shah Mohammad Reza Pahlavi. After the revolution and the U.S. Embassy hostage crisis, those shipments and maintenance programmes stopped. Iran’s eight-year war with Iraq in the 1980s destroyed much of its arsenal. International sanctions on Iran, including over its nuclear programme, also have kept it from receiving new arms while Israel and Gulf Arab states allied with the U.S. have received advanced weapons. While developing its own missile programme, Iran cannot match those sophisticated weapons. It relies on militias as an asymmetric threat to squeeze both Israel and the U.S.",
    "imageUri": "https://th-i.thgim.com/public/incoming/8vyh9d/article68491385.ece/alternates/LANDSCAPE_660/2024-08-05T184826Z_1484744630_RC2U99ASASZ9_RTRMADP_3_IRAN-RUSSIA.JPG",
    "postUri": "https://www.thehindu.com/news/international/irans-promised-retaliation-could-see-regional-proxies-playing-a-greater-role/article68491382.ece"
  },
  {
    "title": "Long Battle for a Ruined City Takes a Desperate Turn",
    "description": "As the Ukrainian soldiers raced through the ruins of the destroyed city under the spying eye of Russian drones, the skeletal remains of blasted-out buildings cast eerie shadows in the light of a full moon. Burned-out cars littered the road next to craters from artillery strikes in this city, Toretsk, in the Donetsk region of eastern Ukraine, that is now on the front line of the war with Russia.",
    "imageUri": "https://static01.nyt.com/images/2024/08/01/multimedia/00Ukraine-Frontline-01-bkvp/00Ukraine-Frontline-01-bkvp-jumbo.jpg?quality=75&auto=webp",
    "postUri": "https://www.nytimes.com/2024/08/06/world/europe/ukraine-war-donetsk-toretsk.html"
  },
  {
    "title": "Harris Nears Her Big V.P. Reveal After Fierce Lobbying From Democrats",
    "description": "Vice President Kamala Harris is expected to reveal her running mate on Tuesday morning, a decision that will end a 16-day sprint to vet, interview and choose a person who could potentially become the future leader of the Democratic Party. Ms. Harris’s announcement, coupled with a major rally she plans to hold with her running mate on Tuesday evening in Philadelphia, will also cap a frenzied period that had, in recent days, exposed some of the party’s internal fissures on matters ranging from labor rights to Israel’s military campaign in Gaza.",
    "imageUri": "https://static01.nyt.com/images/2024/08/05/multimedia/05pol-harris-lobbying-1-bglp/05pol-harris-lobbying-1-bglp-jumbo.jpg?quality=75&auto=webp",
    "postUri": "https://www.nytimes.com/2024/08/05/us/politics/kamala-harris-vp-pick-democrats.html"
  },
  {
    "title": "US-Based Indian Man Asks Candidates to Avoid 'Hindi-Speaking' Workplaces: 'Not Worth It'",
    "description": "An Indian-origin man working for a US-based company is receiving massive backlash on social media for his post advising job seekers to 'politely decline' job offers under certain conditions. In the now-viral post, he warns candidates to be cautious when accepting job offers, specifically advising them to check the English-speaking fluency of the interviewer. He suggests that if the interviewer uses Hindi words, the job is not worth taking. 'A lot of Indian friends are entering the job market, switching jobs, among other things. The biggest advice I have to avoid bad managers and companies is: pick a manager who speaks fully in English. During interviews, pay attention to how your future boss is talking. If you notice one Hindi word or Hindi sentence (frequently to other colleagues), politely decline the job after the call. It will not be worth it,' the man wrote.",
    "imageUri": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA1ofnPz.img?w=612&h=344&m=6",
    "postUri": "https://www.msn.com/en-in/entertainment/oscars/us-based-indian-man-asks-candidates-to-avoid-hindi-speaking-workplaces-not-worth-it/ar-AA1ofgHh?ocid=BingNewsSerp"
  },
  {
    "title": "Japan stocks jump in record daily gain after slump",
    "description": "Japanese shares rebounded on Tuesday after plunging on Monday and sending shockwaves through global financial markets. The Nikkei 225 stock index jumped by 10.23%, or 3,217 points in its biggest one day gain in points. In London, the FTSE 100 opened higher following the previous day's fall, while stock markets in Paris and Frankfurt also rose. The sharp fall in Tokyo followed the Bank of Japan's decision to raise interest rates for just the second time in 17 years. It sent the yen soaring against the dollar making Japanese stocks - and the country's exports - more expensive for foreign investors and buyers.",
    "imageUri": "https://ichef.bbci.co.uk/news/1024/cpsprodpb/e3fc/live/fb80b380-53b0-11ef-918b-7da91fa68c39.jpg.webp",
    "postUri": "https://www.bbc.com/news/articles/c1d77xe2p26o"
  }
]
